// Query for LAPS account password retrievals
AuditLogs 
| where TimeGenerated > ago(90d)
| where OperationName == 'Recover device local administrator password'
| mv-expand TargetResources
| extend DeviceName = TargetResources.displayName
| extend DeviceId = TargetResources.id
| extend Actor = iif(isnotempty(InitiatedBy.user.userPrincipalName), InitiatedBy.user.userPrincipalName, InitiatedBy.app.appId),
| project TimeGenerated, ActivityDisplayName, Actor, DeviceName, DeviceId
