# T1562.002.ADCS.DisableAdvancedAuditing.001

Detect disablement of ADCS advanded auditing for security event.

## Hunt Tags

**ID:** T1528.Entra.UserAccessTokenTheft

**Author:** [Nicola Suter](https://nicolasuter.ch)

**License:** [MIT License](https://github.com/nicolonsky/ITDR/blob/main/LICENSE)

**References:** [Link to medium post](https://nicolasuter.medium.com)

## ATT&CK Tags

**Tactic:** Credential Access (TA0006)

**Technique:** Steal Application Access Token (T1528)

## Technical description of the attack

In order to evade detection an attacker may use binaries that mimic a trusted certificate or modified signed binaries to make outbound network connections for various reasons. The binary can also be completely unsigned which stands out even more.

## Permission required to execute the technique

Access to the device or service where the service principal is being used, such as a CI/CD pipeline running on GitHub Actions.

## Detection description

By combining the network Microsoft Graph Activity Logs and the SignInEvents towards the difference between IP addresses we have a fairly trustworthy means of detection.

## Utilized Data Source

| Event ID | Event Name                    | Log Provider | ATT&CK Data Source |
| -------- | ----------------------------- | ------------ | ------------------ |
| -        | MicrosoftGraphActivityLogs    | Entra ID     | Cloud Service      |
| -        | AADManagedIdentitySignInLogs  | Entra ID     | Cloud Service      |
| -        | AADServicePrincipalSignInLogs | Entra ID     | Cloud Service      |

## Hunt details

### KQL

**FP Rate:** _Low_

**Source:** _Entra ID_

**Description:** _This detection looks at differences within the IP adresses between the access token issuance and usage._

**Query:**

```kusto
// ADCS and Registry Audit Policy Change on Windows to impair ADCS event forwarding
let adcsServers = dynamic(["adcs01.intra.nicolonsky.ch", "adcs02.intra.nicolonsky.ch"]);
// https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-gpac/77878370-0712-47cd-997d-b07053429f6d
let subCategories = datatable (SubcategoryGuid: guid, SubCategoryName: string)
[
    "0CCE921E-69AE-11D9-BED3-505054503030", "Registry",
    "0CCE9221-69AE-11D9-BED3-505054503030", "Certification Services"
];
DeviceEvents
| where ActionType == "AuditPolicyModification"
| where DeviceName in~ (adcsServers)
| mv-expand parse_json(AdditionalFields)
| extend CategoryId = tostring(AdditionalFields.CategoryId)
| extend SubcategoryGuid = toguid(AdditionalFields.SubcategoryGuid)
| lookup kind=inner subCategories on SubcategoryGuid
| project Timestamp, DeviceId, DeviceName, ActionType, SubcategoryGuid, SubCategoryName, ReportId
```

## Considerations

- Only MicrosoftGraphActivityLogs with a corresponding SignIn are considered (due to inner join).

## False Positives

## Detection Blind Spots

## References

- https://learn.microsoft.com/en-us/graph/microsoft-graph-activity-logs-overview
